app/views/carts/_cart.html.erb

<table>
    <% @cart.lineitems.each do |line| %>
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 7]]