app/controllers/lineitems_controller.rb

  def create
    product = Product.find(params[:product_id])
    @lineitem = @cart.add_item(product.id)

    respond_to do |format|
      if @lineitem.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-06-11 05:11:44.862298"], ["updated_at", "2021-06-11 05:11:44.862298"]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 4], ["cart_id", 5], ["created_at", "2021-06-11 05:22:42.446148"], ["updated_at", "2021-06-11 05:22:42.446148"]]
UPDATE "lineitems" SET "updated_at" = ?, "quantity" = ? WHERE "lineitems"."id" = ?  [["updated_at", "2021-06-11 05:53:42.641259"], ["quantity", 2], ["id", 1]]