app/controllers/orders_controller.rb

  def new
    if @cart.lineitems.empty?
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 21]]
SELECT 1 AS one FROM "lineitems" WHERE "lineitems"."cart_id" = ? LIMIT ?  [["cart_id", 21], ["LIMIT", 1]]

  def create
    @order = Order.new(order_params)
    @order.add_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "paytype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "PD"], ["address", "test1"], ["email", "test1"], ["paytype", "Venmo"], ["created_at", "2021-06-14 00:50:09.440162"], ["updated_at", "2021-06-14 00:50:09.440162"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 21]]