app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["description", ""], ["image", ""], ["created_at", "2021-06-11 03:47:11.183572"], ["updated_at", "2021-06-11 03:47:11.183572"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "test validation1"], ["image", "x.jpg"], ["updated_at", "2021-06-11 03:53:59.299186"], ["id", 9]]