app/controllers/concerns/current_cart.rb

    def set_cart
        @cart = Cart.find(session[:cart_id])
    rescue
        @cart = Cart.create()
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-06-11 05:11:44.862298"], ["updated_at", "2021-06-11 05:11:44.862298"]]